etc/nix/modules/editors/emacs/config.org
#+title: Doom Configuration
#+author: Ryan King
#+property: header-args:emacs-lisp :tangle yes :comments link
#+property: header-args:elisp :exports code
#+property: header-args :tangle no :results silent :eval no-export
#+startup: fold
* References
** Posts
- [[https://www.mtsolitary.com/20210309194647-my-org-mode-setup/][Mt. Solitarity org/roam setup]]
- [[https://yiming.dev/blog/2018/03/02/my-org-refile-workflow/][Org Refile Workflow]]
- [[https://coredumped.dev/2021/05/26/taking-org-roam-everywhere-with-logseq/][Org Roam + LogSeq]]
- [[https://rgoswami.me/posts/org-note-workflow/][Orgmode Note Workflow]]
- [[https://config.daviwil.com/workflow][Orgmode Workflow]]
** Example Configurations
- [[https://github.com/tecosaur/emacs-config][Tecnosaur's fancy config]]
- [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org][Emacs from Scratch Config]]
- [[https://github.com/ztlevi/doom-config][ztlevi's blazing fast doom config]]
- [[https://github.com/shaunsingh/nix-darwin-dotfiles][shaunsingh's literate config]]
- [[https://github.com/clintonboys/emacs.d/blob/master/init.org][Mt. Solidarity Org config]]
* Doom File Setup
Setup the Doom config files.
** ~init.el~
The ~init.el~ file contains the doom module definitions. Modules add in packages and configuration.

#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :comments no
;;; init.el -*- lexical-binding: t; -*-

(doom! :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :config
       <<doom-config>>)
#+end_src
** ~packages.el~
This file configures packages such as adding additional ones or changing versions.

#+begin_src emacs-lisp :tangle "packages.el" :comments no
;;; -*- no-byte-compile: t; -*-
#+end_src

** ~config.el~
This file contains all user configuration.

#+begin_src emacs-lisp :comments no
;;; config.el -*- lexical-binding: t; -*-
#+end_src

** ~cli.el~
The ~doom~ CLI loads this file every time that it runs. Don't require confirmation for org tangle.

#+begin_src emacs-lisp :tangle "cli.el" :comments no
;;; cli.el -*- lexical-binding: t; -*-
(setq org-confirm-babel-evaluate nil)

(defun doom-shut-up-a (orig-fn &rest args)
  (quiet! (apply orig-fn args)))

(advice-add 'org-babel-execute-src-block :around #'doom-shut-up-a)
#+end_src
* Core Configuration
** Personal Information
Set the user information. Nix will template in the git author info at rebuild time.

#+begin_src emacs-lisp
(setq user-full-name "@gitName@"
      user-mail-address "@gitEmail@")
#+end_src

Move cached auth information out of ~$EMACSDIR~.

#+begin_src emacs-lisp
(setq auth-sources '("~/.local/share/doom/authinfo.gpg")
      auth-source-cache-expiry nil)
#+end_src
** Better Defaults
Some simple settings to make things a bit better.

#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"                ; Unicode ellispis are nicer than "...", and also save /precious/ space
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-margin 2                             ; It's nice to maintain a little margin
      evil-vsplit-window-right t                  ; Vertical split to the right
      evil-split-window-below t)                  ; Split below

(global-subword-mode 1)                           ; Iterate through CamelCase words
#+end_src

Use small frame for new Emacs instances.

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(height . 24))
(add-to-list 'default-frame-alist '(width . 80))
#+end_src

Put all customization in a separate file.

#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

** UI Settings
Keep the UI simple and minimalist.

#+begin_src emacs-lisp
(setq fringe-mode 0
      tool-bar-mode 0)
#+end_src
*** Fonts
Set the fonts to the values configured in Nix.

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "@monoFamily@" :weight '@monoWeight@ :size @monoSize@)
      doom-big-font (font-spec :family "@monoFamily@" :weight '@monoWeight@ :size @monoBigSize@)
      doom-unicode-font (font-spec :family "@monoUnicodeFamily@" :weight '@monoWeight@ :size @monoSize@)
      doom-variable-pitch-font (font-spec :family "@sansFamily@" :weight '@sansWeight@ :size @sansSize@)
      doom-serif-font (font-spec :family "@serifFamily@" :weight '@serifWeight@ :size @serifSize@))
#+end_src

Setup mixed pitch for certain modes. Use a hook so that it runs after UI initialization.

#+begin_src emacs-lisp
(defvar mixed-pitch-modes '(org-mode LaTeX-mode markdown-mode gfm-mode Info-mode)
  "Modes to enable `mixed-pitch-mode' in, but only after UI initialisation.")

(defun init-mixed-pitch-h ()
  "Hook `mixed-pitch-mode' into each mode in `mixed-pitch-modes'.
Also immediately enables `mixed-pitch-modes' if currently in one of the modes."
  (when (memq major-mode mixed-pitch-modes)
    (mixed-pitch-mode 1))
  (dolist (hook mixed-pitch-modes)
    (add-hook (intern (concat (symbol-name hook) "-hook")) #'mixed-pitch-mode)))

(add-hook 'doom-init-ui-hook #'init-mixed-pitch-h)
#+end_src

#+begin_src emacs-lisp
(after! mixed-pitch
  (defface variable-pitch-serif
    '((t (:family "serif")))
    "A variable-pitch face with serifs."
    :group 'basic-faces)
  (setq mixed-pitch-set-height t)
  (setq variable-pitch-serif-font (font-spec :family "Alegreya" :size 27))
  (set-face-attribute 'variable-pitch-serif nil :font variable-pitch-serif-font)
  (defun mixed-pitch-serif-mode (&optional arg)
    "Change the default face of the current buffer to a serifed variable pitch, while keeping some faces fixed pitch."
    (interactive)
    (let ((mixed-pitch-face 'variable-pitch-serif))
      (mixed-pitch-mode (or arg 'toggle)))))
#+end_src
*** Themes
The Nix configuration also sets the theme.

#+begin_src emacs-lisp
(setq doom-theme '@theme@)
(setq doom-nord-padded-modeline t)
#+end_src
*** Dashboard
Customize the dashboard key bindings.

#+begin_src emacs-lisp
(map! :map +doom-dashboard-mode-map
      :ne "f" #'find-file
      :ne "r" #'consult-recent-file
      :ne "p" #'doom/open-private-config
      :ne "c" (cmd! (find-file (expand-file-name "config.org" doom-private-dir)))
      :ne "." (cmd! (doom-project-find-file "~/Workshop/"))
      :ne "b" #'+vertico/switch-workspace-buffer
      :ne "B" #'consult-buffer
      :ne "q" #'save-buffers-kill-terminal)
#+end_src
