etc/nix/modules/editors/emacs/init.el
;;; init.el -*- lexical-binding: t; -*-

(doom! :completion
