etc/nix/modules/editors/emacs/config.org
*** Misc
Relative line numbers are essential.

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

Better buffer names.

#+begin_src emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src

** Keybindings
Use arrow keys instead of ~hjlk~ to support layered Colemak.

#+begin_src emacs-lisp
(map!
 "C-<left>" #'evil-window-left
 "C-<right>" #'evil-window-right
 "C-<up>" #'evil-window-up
 "C-<down>" #'evil-window-down

 "C-S-<left>" #'+evil/window-move-left
 "C-S-<right>" #'+evil/window-move-right
 "C-S-<up>" #'+evil/window-move-up
 "C-S-<down>" #'+evil/window-move-down)
#+end_src
** Asynchronous Configuration Tangling
Use Tecosaur's async config tangling setup.

#+begin_src emacs-lisp
(defvar +literate-tangle--proc nil)
(defvar +literate-tangle--proc-start-time nil)

(defadvice! +literate-tangle-async-h ()
  "A very simplified version of `+literate-tangle-h', but async."
  :override #'+literate-tangle-h
  (unless (getenv "__NOTANGLE")
    (let ((default-directory doom-private-dir))
      (when +literate-tangle--proc
        (message "Killing outdated tangle process...")
        (set-process-sentinel +literate-tangle--proc #'ignore)
        (kill-process +literate-tangle--proc)
        (sit-for 0.3)) ; ensure the message is seen for a bit
      (setq +literate-tangle--proc-start-time (float-time)
            +literate-tangle--proc
            (start-process "tangle-config"
                           (get-buffer-create " *tangle config*")
                           "emacs" "--batch" "--eval"
                           (format "(progn \
(require 'ox) \
(require 'ob-tangle) \
(setq org-confirm-babel-evaluate nil \
      org-inhibit-startup t \
      org-mode-hook nil \
      write-file-functions nil \
      before-save-hook nil \
      after-save-hook nil \
      vc-handled-backends nil \
      org-startup-folded nil \
      org-startup-indented nil) \
(org-babel-tangle-file \"%s\" \"%s\"))"
                                   +literate-config-file
                                   (expand-file-name (concat doom-module-config-file ".el")))))
      (set-process-sentinel +literate-tangle--proc #'+literate-tangle--sentinel)
      (run-at-time nil nil (lambda () (message "Tangling config.org"))) ; ensure shown after a save message
      "Tangling config.org...")))

(defun +literate-tangle--sentinel (process signal)
  (cond
   ((and (eq 'exit (process-status process))
         (= 0 (process-exit-status process)))
    (message "Tangled config.org sucessfully (took %.1fs)"
             (- (float-time) +literate-tangle--proc-start-time))
    (setq +literate-tangle--proc nil))
   ((memq (process-status process) (list 'exit 'signal))
    (+popup-buffer (get-buffer " *tangle config*"))
    (message "Failed to tangle config.org (after %.1fs)"
             (- (float-time) +literate-tangle--proc-start-time))
    (setq +literate-tangle--proc nil))))

(defun +literate-tangle-check-finished ()
  (when (and (process-live-p +literate-tangle--proc)
             (yes-or-no-p "Config is currently retangling, would you please wait a few seconds?"))
    (switch-to-buffer " *tangle config*")
    (signal 'quit nil)))
(add-hook! 'kill-emacs-hook #'+literate-tangle-check-finished)
#+end_src

** Misc
*** Native Compilation
Run emacs28's new native-compiler with ~-O3~, if available.

#+begin_src emacs-lisp
(when 'native-comp-compiler-options
  (setq native-comp-compiler-options '("-O3")))
#+end_src
*** Window Title
Set the window title to the buffer name and project folder.

#+begin_src emacs-lisp
(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?  buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))
#+end_src
*** Daemon
Use Tecosaur's greedy daemon startup.

#+begin_src emacs-lisp
(defun greedily-do-daemon-setup ()
  (require 'org)
  (require 'vertico)
  (require 'consult)
  (require 'marginalia)
  (when (require 'mu4e nil t)
    (setq mu4e-confirm-quit t)
    (setq +mu4e-lock-greedy t)
    (setq +mu4e-lock-relaxed t)
    (+mu4e-lock-add-watcher)
    (when (+mu4e-lock-available t)
      (mu4e~start))))

(when (daemonp)
  (add-hook 'emacs-startup-hook #'greedily-do-daemon-setup)
  (add-hook 'emacs-startup-hook #'init-mixed-pitch-h))
#+end_src
* Module Configuration
Configuration for Doom modules.
** Completion
#+name: doom-completion
#+begin_src emacs-lisp :tangle no
(company +childframe)
(vertico +icons)
#+end_src
*** Company
Slow down company a bit.

#+begin_src emacs-lisp
(after! company
   (setq company-idle-delay 0.1
      company-minimum-prefix-length 1
      company-selection-wrap-around t
      company-require-match 'never
      company-dabbrev-downcase nil
      company-dabbrev-ignore-case t
      company-dabbrev-other-buffers nil
      company-tooltip-limit 5
      company-tooltip-minimum-width 50))
(set-company-backend!
  '(text-mode
    markdown-mode
    gfm-mode)
  '(:seperate
    company-yasnippet
    company-ispell
    company-files))

;;nested snippets
(setq yas-triggers-in-field t)
#+end_src
** UI
#+name: doom-ui
#+begin_src emacs-lisp :tangle no
deft
doom
doom-dashboard
doom-quit
(:if IS-LINUX (emoji +unicode +github))
;; fill-column
hl-todo
ligatures
modeline
nav-flash
ophints
(popup +all +defaults)
(treemacs +lsp)
vc-gutter
window-select
workspaces
zen
#+end_src
*** Packages
#+begin_src emacs-lisp :tangle "packages.el" :comments yes
(unpin! doom-themes doom-modeline)
(package! solaire-mode :disable t)
(package! ox-chameleon :recipe (:host github :repo "tecosaur/ox-chameleon"))
#+end_src
*** Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-major-mode-icon t
        doom-modeline-buffer-file-name-style 'truncate-with-project
        doom-modeline-modal-icon t
        inhibit-compacting-font-caches t))
#+end_src
** Editor
#+name: doom-editor
#+begin_src emacs-lisp :tangle no
(evil +everywhere)
file-templates
fold
(format +onsave)
snippets
word-wrap
#+end_src
** Emacs
#+name: doom-emacs
#+begin_src emacs-lisp :tangle no
(dired +ranger +icons)
electric
(ibuffer +icons)
(undo +tree)
vc
#+end_src
*** IBuffer
#+begin_src emacs-lisp
(setq-hook! 'ibuffer-hook ibuffer-formats
            '((mark modified read-only locked " "
                    (name 50 18 :left :elide)
                    " "
                    (size 9 -1 :right)
                    " "
                    (mode 16 16 :left :elide)
                    " " filename-and-process)
              (mark " "
                    (name 16 -1)
                    " " filename)))
#+end_src
** Term
#+name: doom-term
#+begin_src emacs-lisp :tangle no
eshell
vterm
#+end_src

Set the shell explicitly to the fish shell.

#+begin_src emacs-lisp
(setq explicit-shell-file-name (executable-find "fish"))
#+end_src

Enable ligature support.

#+begin_src emacs-lisp
(setq +ligatures-in-modes t)
#+end_src

*** ~Vterm~
Until I can fully move over to ~eshell~ like a man, setup ~vterm~.

Always compile the ~vterm~ module.

#+begin_src emacs-lisp
(setq vterm-always-compile-module t)
#+end_src

Kill the ~vterm~ buffer when the process exits.

#+begin_src emacs-lisp
(setq vterm-kill-buffer-on-exit t)
#+end_src
** Checkers
#+name: doom-checkers
#+begin_src emacs-lisp :tangle no
syntax
(spell +aspell)
grammar
#+end_src
** Tools
#+name: doom-tools
#+begin_src emacs-lisp :tangle no
(debugger +lsp)
direnv
(docker +lsp)
(eval +overlay)
gist
(lookup +devdocs +docsets)
(lsp +peek)
(magit +forge)
make
pdf
rgb
taskrunner
tmux
upload
#+end_src
*** Packages
#+begin_src emacs-lisp :tangle "packages.el" :comments yes
(unpin! lsp-mode lsp-Ui)
#+end_src
** OS
#+name: doom-os
#+begin_src emacs-lisp :tangle no
(:if IS-MAC macos)
(tty +osc)
#+end_src
** Lang
#+name: doom-lang
#+begin_src emacs-lisp :tangle no
data
emacs-lisp
(go +lsp)
(json +lsp)
(lua +fennel)
markdown
nix
(org +hugo +journal +pretty +roam2)
(rust +lsp)
(sh +fish +lsp)
(yaml +lsp)
#+end_src
