etc/nix/modules/editors/emacs/config.org
** Org
Utility functions to get files in Dropbox.

#+begin_src emacs-lisp
(defun dropbox-file (path)
  (concat (getenv "HOME") "/Dropbox/" path))

(defun dropbox-files (&rest paths)
  (mapcar #'dropbox-file paths))
#+end_src

Setup basic org-mode configuration.

#+begin_src emacs-lisp
(setq org-directory (dropbox-file "org"))

(sp-local-pair
 '(org-mode)
 "<<" ">>"
 :actions '(insert))

(after! org
  (setq

   org-agenda-files
   (dropbox-files "org/inbox.org" "org/personal.org" "org/projects.org" "org/inbox_work.org" "org/work.org")

   org-todo-keywords
   '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
     (sequence"BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)"
              "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)""CANC(k@)"))

   org-agenda-prefix-format
   '((agenda . " %i %?-12t% s")
     (todo . " %i")
     (tags . " %i %-12:c")
     (search . " %i %-12:c"))

   org-capture-templates
   `(("p" "Personal" entry (file ,(dropbox-file "org/inbox.org")) "* TODO %?\n %i\n %a")
     ("w" "Work" entry (file+headline ,(dropbox-file "org/inbox_work.org") "To refile") "* TODO %?\n %i\n %a"))))
#+end_src

*** Packages
#+begin_src emacs-lisp :tangle "packages.el" :comments yes
(package! org-ref)
(package! org-roam-ui)
#+end_src

*** Agenda
#+begin_src emacs-lisp
(after! org-agenda
  (setq
   org-agenda-custom-commands
   '(("a" "Personal"
      ((agenda ""
               ((org-agenda-span 'day)
                (org-agenda-files (dropbox-files "org/personal.org"))
                (org-deadline-warning-days 7)
                (org-agenda-overriding-header "Agenda\n")))
       (todo "TODO"
             ((org-agenda-overriding-header "To Refile\n")
              (org-agenda-prefix-format "  ")
              (org-agenda-files (dropbox-files "org/inbox.org"))))
       (todo "NEXT"
             ((org-agenda-overriding-header "Projects\n")
              (org-agenda-prefix-format "  %c (%e) | ")
              (org-agenda-files (dropbox-files "org/projects.org"))))))
     ("w" "Work"
      ((agenda ""
               ((org-agenda-span 'day)
                (org-agenda-files (dropbox-files "org/work.org"))
                (org-deadline-warning-days 14)
                (org-agenda-overriding-header "Via\n")))
       (todo "TODO"
             ((org-agenda-overriding-header "To Refile\n")
              (org-agenda-prefix-format "  ")
              (org-agenda-files (dropbox-files "org/inbox_work.org"))))
       (todo "NEXT"
             ((org-agenda-overriding-header "Projects\n")
              (org-agenda-prefix-format "  %i %-12:c [%e] ")
              (org-agenda-files (dropbox-files "org/work.org"))))
       (todo "WAITING"
             ((org-agenda-overriding-header "Waiting on others\n")
              (org-agenda-files (dropbox-files "org/work.org")))))))))

;; Highlight additional keywords
(after! hl-todo
  (setq hl-todo-keyword-faces '(("NEXT" warning bold))))
#+end_src

*** Roam
Setup ~org-roam~ and ~deft~ to use the roam folder in Dropbox.

#+begin_src emacs-lisp
(after! org-roam
  (setq org-roam-directory (dropbox-file "roam")))

(after! deft
  (setq deft-directory (dropbox-file "roam")))
#+end_src

*** Journal
#+begin_src emacs-lisp
(after! org-journal
  (setq
   org-journal-date-prefix "#+title: "
   org-journal-file-format "%Y-%m-%d.org"
   org-journal-dir (dropbox-file "roam")
   org-journal-date-format "%Y-%m-%d"))
#+end_src
** Config
#+name: doom-config
#+begin_src emacs-lisp :tangle no
literate
(default +bindings +smartparens)
#+end_src


* Other



* To File

#+begin_src emacs-lisp

;; Appearance
(use-package frame
  :config
  (setq-default default-frame-alist
                (append (list
                         '(internal-border-width . 24)
                         '(left-fringe    . 0)
                         '(right-fringe   . 0)
                         '(tool-bar-lines . 0)
                         '(menu-bar-lines . 0)
                         ;; '(line-spacing . 0.35)
                         '(vertical-scroll-bars . nil))))
  (setq-default window-resize-pixelwise t)
  (setq-default frame-resize-pixelwise t)
  :custom
  (window-divider-default-right-width 24)
  (window-divider-default-bottom-width 12)
  (window-divider-default-places 'right-only)
  (window-divider-mode t))

(custom-set-faces!
  `(vertical-border :background ,(doom-color 'bg) :foreground ,(doom-color 'bg)))

(when (boundp 'window-divider-mode)
  (setq window-divider-default-places nil
        window-divider-default-bottom-width 0
        window-divider-default-right-width 0)
  (window-divider-mode -1))

(defadvice! fix-+evil-default-cursor-fn ()
  :override #'+evil-default-cursor-fn
  (evil-set-cursor-color (face-background 'cursor)))

(defadvice! fix-+evil-emacs-cursor-fn ()
  :override #'+evil-emacs-cursor-fn
  (evil-set-cursor-color (face-foreground 'warning)))

(add-hook 'before-make-frame-hook 'window-divider-mode)

;; remove encoding indicator
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))
(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding) ;;remove encoding

;; Evil Mode
(setq evil-snipe-scope 'visible
      evil-want-fine-undo t
      evil-vsplit-window-right t
      evil-split-window-below t)


;; Vertico
(after! marginalia
  (setq marginalia-censor-variables nil)

  (defadvice! +marginalia--anotate-local-file-colorful (cand)
    "Just a more colourful version of `marginalia--anotate-local-file'."
    :override #'marginalia--annotate-local-file
    (when-let (attrs (file-attributes (substitute-in-file-name
                                       (marginalia--full-candidate cand))
                                      'integer))
      (marginalia--fields
       ((marginalia--file-owner attrs)
        :width 12 :face 'marginalia-file-owner)
       ((marginalia--file-modes attrs))
       ((+marginalia-file-size-colorful (file-attribute-size attrs))
        :width 7)
       ((+marginalia--time-colorful (file-attribute-modification-time attrs))
        :width 12))))

  (defun +marginalia--time-colorful (time)
    (let* ((seconds (float-time (time-subtract (current-time) time)))
           (color (doom-blend
                   (face-attribute 'marginalia-date :foreground nil t)
                   (face-attribute 'marginalia-documentation :foreground nil t)
                   (/ 1.0 (log (+ 3 (/ (+ 1 seconds) 345600.0)))))))
      ;; 1 - log(3 + 1/(days + 1)) % grey
      (propertize (marginalia--time time) 'face (list :foreground color))))

  (defun +marginalia-file-size-colorful (size)
    (let* ((size-index (/ (log10 (+ 1 size)) 7.0))
           (color (if (< size-index 10000000) ; 10m
                      (doom-blend 'orange 'green size-index)
                    (doom-blend 'red 'orange (- size-index 1)))))
      (propertize (file-size-human-readable size) 'face (list :foreground color)))))

;; Treemacs
(setq treemacs-width 40)
(setq doom-themes-treemacs-theme "doom-colors")

;; Tramp
(setq tramp-default-remote-shell "/run/current-system/sw/bin/dash"
      projectile-mode-line "Projectile")

#+end_src
