etc/nix/modules/editors/emacs/init.el
       (default +bindings +smartparens))
